package com.amelkauladzislau.algorithms;

public class algorithms {

    //Перекур
    public static void algorithmOne() {
        //if ( сигарета == true && огонь == true) {
        // Идем на перекур
        // } else { ЗОЖ }
        //
        //if (место == разрешенное для курения) {
        //
        //  Достать сигарету
        //      if (огонь == спички) {
        //      Достать спички;
        //      Подкурить сигарету(спички);
        //      } else {
        //      Достать зажигалку;
        //      Подкурить сигарету(зажигалка);
        //      }
        //
        //  for (int i = 0; i < 10; i++;) {
        //       Сделать затяжку;
        //       Выдохнуть дым;
        //          if ( i% 3 == 0 ) {
        //          Стряхнуть пепел; }
        //      }
        //       Затушить сигарету;
        //       Выкинуть сигарету;
        //
        //} else { Курение запрещено! }
    }

    //Лифт
    public static void algorithmTwo() {

        // Нажать( кнопка вызова лифта )
        // Дождаться открытого лифта
        // Зайти в лифт
        //   if ( этаж == №(мой этаж) ) {
        //   Нажать (кнопка №1)
        //   } else { нажать кнопку №(мой этаж) }
        // Дождаться закрытия дверей
        // Дождаться открытия дверей
        // Выйти из лифта
    }

    //Холодильник
    public static void algorithmThree() {

        // if (голод == true) {
        //      Подойти к холодильнику
        //      Открыть дверь холодильника
        //          if ( лень == true) {
        //          Закрыть холодильник
        //          Отдых
        //          } else {
        //          Взять бутерброд;
        //          Закрыть холодильник;
        // } else { Отдых }

    }

    //Будильник
    public static void algorithmFour() {

        // if (раздражающий звук == true && источник звука == будильник) {
        //    Открыть глаза
        //    Выключить будильник
        //    Потянуться
        //    Встать
        // } else { раздражающий звук == true && источник звука != будильник) {
        //    for (int i = 0; i < 3; i++) {
        //    Ударить в стену
        //    }
        //    Закрыть глаза }
    }

    //Вечер
    public static void algorithmFive() {
        // for (int время = 0; время < 24; i++) {
        //  if ( время > 18 && время < 23) {
        //
        //      Наступает вечер!
        //
        //      if ( голод = true ) {
        //          Выпить кефир
        //          }
        //
        //      if ( время == 21 ) {
        //          Умыться
        //          Почистить зубы
        //          Расстелить кровать
        //          }
        //
        //      if ( время == 22) {
        //          Лечь спать
        //          }
        //  } else { Еще не вечер }
        // }
    }

    //Список покупок
    public static void algorithmSix() {

        // if ( яблоко == 0 || груша == 0 || банан == 0 ) {
        //      Фрукты = true;
        //      Купи Фрукты!
        //      } else {
        //      Фрукты = false;
        //      }
        //
        // if ( морковка == 0 || лук == 0 || огурец == 0 ) {
        //      Овощи = true;
        //      Купи Овощи!
        //      } else {
        //      Овощи = false;
        //      }
        //
        // if ( курица == 0 || говядина == 0 || свинина == 0 ) {
        //      Мясо = true
        //      Купи Мясо!
        //      } else {
        //      Мясо = false
        //      }
        //
        // if ( Мясо == false || Овощи == false || Мясо == false ) {
        //      Ничего покупать не нужно
        // } else if ( Мясо == true || Овощи == true || Мясо == true ) {
        //      Закажи все доставкой
        // } else { Прогуляйся в магазин }


    }

    //Температура
    public static void algorithmSeven() {
        // if ( самочувствие == плохое ) {
        //      Взять градусник
        //      Померять температуру
        //          if ( (температура >= 35 && температура <= 35.5) || (температура >= 37.5 && температура <= 38) ) {
        //          Пойти в поликлиннику
        //          } else if ( температура <= 34.9 || температура >= 38.1) {
        //          Вызвать скорую
        //          } else {
        //          Температура в норме! Запишись к врачу
        //          }
        // } else {
        // Отдых
        // }

    }

    //Математика
    public static void algorithmEight() {
        int a = 2+2;
        if (a > 4) {
            System.out.print("Перебор");
        } else if (a == 4) {
            System.out.print("Правильно");
        } else if (a < 4) {
            System.out.print("Маловато");
        }
    }

    //Создаем баг репорт
    public static void algorithmNine() {
        // Формулируем summary
        //
        // if ( summary == true) {
        // Пишем summary
        // } else {
        // Переформулируем
        // }
        //
        // Переходим в раздел Description
        //
        // if ( preconditions = true) {
        // Пишем preconditions
        // } else {
        // Пропускаем preconditions
        // }
        //
        // Описываем шаги
        // Описываем AR
        // Описываем ER
        // Переходим в раздел Attachments
        //
        // if ( attachment = pic ) {
        // Выделяем на скрине ошибку
        // Добавляем скрин
        // }
        // if ( attachment = video ) {
        //     if (weight > 15) {
        //     Сжимаем видео
        //     Загружаем видео
        //     } else {
        //     Загружаем видео
        //     }
        // Проверяем грамматику
        // if ( spellcheck = false ) {
        // Исправляем ошибки
        // Нажать Submit
        // } else {
        // Нажать Submit
        // }
    }

    //Сделать алгоритм
    public static void algorithmTen() {

        // Придумать алгоритм
        //
        // if ( лень == true ) {
        // Перекур
        // } else {
        // Пишем алгоритм
        // }
        //
        // if ( голод == true ) {
        // Покушать
        // } else {
        // Пишем алгоритм
        // }
        //
        // if ( вдохновение == false ) {
        // Подумать о великом
        // } else {
        // Пишем алгоритм
        // }
        //
        // if ( алгоритм == закончен ) {
        // Отдых
        // } else {
        // Пишем алгоритм
        // }

    }









}
